import { defineStore } from "pinia";

export const useContentStore = defineStore("content", {
  state: () => ({
    status: false,
    url: "https://www.youtube.com/embed/hilxZzolASw?si=Cmn0R5mYTPSJ2bKr",
    desc: `     โรคมะเร็งที่พบบ่อยเป็นอันดับที่ 3 ของคนไทย ผู้ป่วยส่วนใหญ่กว่าจะรู้ว่าเป็น "มะเร็งลำไส้ใหญ่"
                เมื่อมีอาการขับถ่ายผิดปกติ เช่น ถ่ายอุจจาระเป็นเลือด ถ่ายมีมูกเลือด
                ท้องผูก ปวดเบ่งถ่ายตลอดเวลา อุจจาระลำเล็กลง ก็มักพบโรคในระยะที่เป็นมากแล้ว
                ซึ่งทำให้มีโอกาสการเสียชีวิตสูง การตรวจคัดกรองเพื่อป้องกันโรคมะเร็งลำไส้ใหญ่ (การ
                ตรวจคัดกรอง คือการตรวจตั้งแต่ผู้ป่วยไม่มีอาการผิดปกติใด ๆ
                หรือการมาพบแพทย์ทันทีตั้งแต่มีอาการผิดปกติในระยะเริ่มแรกเป็นวิธีที่ดีที่สุด เพราะสำหรับโรคมะเร็ง
                ลำไส้ใหญ่แล้ว ถ้ารู้เร็ว รักษาเร็วและถูกวิธีก็จะมีโอกาสหายมากขึ้น
                มะเร็งลำไส้ใหญ่และทวารหนัก มักพบมากในผู้ที่มีอายุ 50 ปีขึ้นไป แต่ก็สามารถเกิดได้ในทุกเพศทุกวัย
                อายุเฉลี่ยของคนไทยที่ตรวจพบมะเร็งชนิดนี้อยู่ในช่วงอายุ 60 -
                65 ปี ผู้ที่มีประวัติบุคคลในครอบครัวป่วยเป็นมะเร็งลำไส้ใหญ่และทวารหนักจะมีโอกาสเสี่ยงมากกว่าคนทั่ไป
                โดยเฉพาะบุคคลในครอบครัวนั้นเป็นญาติสายตรงลำดับแรก ได้แก่
                พ่อแม่ พี่น้อง และบุตร
                ปัจจุบันยังไม่ทราบสาเหตุที่แท้จริงของการเกิดมะเร็งลำไส้ใหญ่ แต่เชื่อว่าการรับประทานอาหารที่มีใยอาหารมาก
                ไขมันน้อย ร่วมกับการออกกำลังกายสม่ำเสอ และการ
                ป้องกันภาวะท้องผูกจะลดโอกาสการเกิดมะเร็งลำไส้ใหญ่ได้
                สำหรับการตรวจพบแต่เนิ่น ๆ ต้องทำตั้งแต่ยังไม่มีอาการผิดปกติ เรียกการตรวจนี้ว่า
                "การตรวจคัดกรองมะเร็งลำไส้ใหญ่" ซึ่งแนะนำให้เริ่มตรวจคัดกรองในผู้ที่อายุ 50 ปี
                ขึ้นไป และมีหลายวิธี เช่น การตรวจเม็ดเลือดแดงในอุจจาระก 1 - 2 ปี, การสวนสารทึบรังสีตรวจลำไส้ใหญ่
                หรือการส่องกล้องตรวจลำไส้ใหญ่ทุก 5 ปี เป็นต้น`,
  }),
  actions: {
    setStatus(newStatus: boolean) {
      this.status = newStatus;
    },
  },
});
